app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "plan", "stripe_customer_id", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      customer = create_stripe_customer(@user)
      @session = create_checkout_session(customer, @user)
      @user.save!

INSERT INTO "users" ("email", "password_digest", "plan", "stripe_customer_id", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create_stripe_customer(user)
    customer = Stripe::Customer.create(
      email: @user.email,
      metadata: {
        selected_plan: @user.plan
      }
    )